ХамелионЦРПТ/src/Catalogs/Пользователи_ХамелеонЦРПТ/Пользователи_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи_ХамелеонЦРПТ</name>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сайт</name>
    <type>
      <types>EnumRef.Сайты_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособФормированияСН</name>
    <type>
      <types>EnumRef.СпособФормированияСН_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСИ</name>
    <type>
      <types>EnumRef.ВидСИ_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМаркировки</name>
    <type>
      <types>EnumRef.ВидМаркировки_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговораСОператором</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговораСОператором</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособИзготовленияСИ</name>
    <type>
      <types>EnumRef.СпособИзготовленияСИ_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <type>
      <types>CatalogRef.ШаблоныЭтикеток_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПрокси</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПортПрокси</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПрокси</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольПрокси</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СертификатТумбер</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>PIN</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННСертификата</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеСертификата</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьСерийныеНомераАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательСУЗ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольСУЗ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСайтаСУЗ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодключатьсяКGS1Автоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТокенКСУЗ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СохранятьPDFнаДиск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогСохранения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Демо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СайтыВходаВСистему</name>
    <type>
      <types>CatalogRef.ВходВСистему_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВводаВОборот</name>
    <type>
      <types>EnumRef.ТипыДокументаВводВОборот_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСУЗ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>EnumRef.ТипОплаты_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>РегисстрационныйНомер</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКлиентаМДЛП</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СекретныйКодМДЛП</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКМПоУмолчанию</name>
    <type>
      <types>EnumRef.Шаблоны_подписи_кодов_КМ_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКМТабакПоУмолчанию</name>
    <type>
      <types>EnumRef.Шаблоны_подписи_кодов_КМ_Табак_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКМ</name>
    <type>
      <types>EnumRef.СтатусыКМДляАгрегации_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВнешнийСертификат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГУИД_ХС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГУИД_Площадки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольМеркурий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПоУмолчанию</name>
    <type>
      <types>CatalogRef.СтранаПроизводства_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>КодТаможенногоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПринятогоРешения</name>
    <type>
      <types>CatalogRef.КодПринятогоРешения_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьИОтправлятьВводВОборотПослеЭмитирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючДляРаботыСНК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛогинДляСБ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольДляСБ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючРазработчика</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПодключенияСБ</name>
    <type>
      <types>EnumRef.ТипыПодключенияКЭДОСБ_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогинКонтур</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольКонтур</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_ВЭБ_Меркурий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействияСертификата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлюсЧасовойПоясДляЛекарств</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСоединения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПеремаркировки</name>
    <type>
      <types>EnumRef.ТипДокументаПеремаркировки_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучитьТокен</name>
    <type>
      <types>EnumRef.ТипПолученияТокенаИзПользователя_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>omsConnection</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресРегистрацииУчтенойСистемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаХС</name>
    <attributes>
      <name>ГУИД_ХС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаПлощадок</name>
    <attributes>
      <name>ГУИД_Площадок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИД_ВЭБ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ГУИД_ХС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ХамелионЦРПТ/src/InformationRegisters/СохранитьКэшМеркурий_ХамелеонЦРПТ/СохранитьКэшМеркурий_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СохранитьКэшМеркурий_ХамелеонЦРПТ</name>
  <resources>
    <name>Кэш</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи_ХамелеонЦРПТ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ХамелионЦРПТ/src/Catalogs/Пользователи_ХамелеонЦРПТ/Forms/ФормаПодключениеПоГВЭ/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
//		Реквизит1="https://merucry.vetrf.ru"
	ПодключитьОбработчикОжидания("аа",0.1,Истина);
КонецПроцедуры

&НаКлиенте
Процедура аа() 
	Реквизит1="https://mercury.vetrf.ru/hs";
	Флаг=ложь;
//	ПодключитьОбработчикОжидания("аа_1",0.1,Истина);
//	
//	
//	//а=1;
КонецПроцедуры

//&НаКлиенте
//Процедура аа_1() 
//	Если Флаг<>Истина Тогда
//		
//		ПодключитьОбработчикОжидания("аа_1",1,Истина);
//	Иначе
//		
//		
//		
//		а=1;
//	Конецесли;
//Конецпроцедуры


&НаКлиенте
Процедура Поле2ПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Поле1ПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
//	а=1;
КонецПроцедуры

&НаКлиенте
Процедура Поле1ДокументСформирован(Элемент)
	// Вставить содержимое обработчика.
	Флаг=Истина;
	
	Попытка
		Если Элементы.Поле1.Документ.forms["loggedas"]<>Неопределено Тогда
			ЗаписатьКукиНаСервере(Элементы.Поле1.Документ.Cookie);
			ЭтаФорма.Закрыть();
			Сообщить("Успешное подключение к Меркурию");
			Возврат;
		//	а=1;
		Конецесли;
		
		
		Если Элементы.Поле1.Документ.forms["username"]<>Неопределено Тогда
			Элементы.Поле1.Документ.forms["username"].value=ВернутьИнициатора(Пользователь);
			Элементы.Поле1.Документ.forms["password"].value=ВернутьПароль(Пользователь);
			
			
			Документ = Элементы.Поле1.Документ;

			ЭлементыHTMLДокумента =Документ.querySelectorAll("[type=""submit""]");

			Для Каждого ТекЭлементHTMLДокумента Из ЭлементыHTMLДокумента Цикл
			        ТекЭлементHTMLДокумента.click();
					  
					  Прервать;
			    КонецЦикла;		
		//	СТ = "submit"; 		
		////	ЭлементHTMLДокумента = Элементы.Поле1.Документ.querySelector("input[type="""+СТ+"""]");
		//	ЭлементHTMLДокумента.click();		
			
	Конецесли;
	Исключение
	КонецПопытки;
	//	Элементы.Поле1.Документ.ПолучитьЭлементыПоИмени("input");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернутьИнициатора(Поль)
	Возврат Поль.Инициатор
КонецФункции


&НаСервереБезКонтекста
Функция ВернутьПароль(Поль)
	Возврат Поль.ПарольМеркурий
КонецФункции

&НаСервере
Процедура ЗаписатьКукиНаСервере(Куки)
	// Вставить содержимое обработчика.
	Попытка
		
		УстановитьПривилегированныйРежим (Истина);
		
		
		Струк=СтрокаВМассивСтрок(Куки,";");
		ВсеКуки="";
		Для Каждого Стр_11 Из Струк Цикл
			
			ВсеКуки=ВсеКуки+Символы.ПС+"Set-Cookie: "+Стр_11+";";
			
		Конеццикла;
		
		РегДв=РегистрыСведений.СохранитьКэшМеркурий_ХамелеонЦРПТ.СоздатьНаборЗаписей();
		РегДв.Отбор.Пользователь.Установить(Пользователь);
		Добав=РегДв.Добавить();
		Добав.Пользователь=Пользователь;
		Добав.Кэш=ВсеКуки;
		Регдв.Записать(Истина);
		
		УстановитьПривилегированныйРежим (Ложь);
		
		
	Исключение
	КонецПопытки;
КонецПроцедуры

Функция СтрокаВМассивСтрок(Знач Стр, Разделитель)
    
    Результат = Новый Массив;
    
    Строки = СтрЗаменить(Стр, Разделитель, Символы.ПС);
    
    Для Индекс = 1 По СтрЧислоСтрок(Строки) Цикл
        Результат.Добавить(СтрПолучитьСтроку(Строки, Индекс));
    КонецЦикла;
    
    Возврат Результат;
    
КонецФункции
&НаКлиенте
Процедура ЗаписатьКуки(Команда)
	ЗаписатьКукиНаСервере(Элементы.Поле1.Документ.Cookie);
КонецПроцедуры
